# RBS Salary final Rank

In [1]:
import pandas as pd

In [2]:
salary = pd.read_csv('../Capstone_csv_file/salary_edited_to_fit_19-20')

In [3]:
rbs = pd.read_csv('../Capstone_csv_file/rbs_final_rank_19-20')

In [4]:
rbs

                   NAME  final_rank
0   Christian McCaffrey         1.0
1           Marlon Mack         2.0
2             Joe Mixon         3.0
3        Saquon Barkley         4.0
4       Phillip Lindsay         5.0
..                  ...         ...
92        Jalen Richard        93.0
93         Spencer Ware        94.0
94           CJ Prosise        95.0
95    Jonathan Hilliman        96.0
96            TJ Yeldon        97.0

[97 rows x 2 columns]

In [5]:
rbs.set_index('NAME', inplace = True)

In [6]:
rbs_final_salary = rbs.merge(salary, on = 'NAME')

In [7]:
rbs_final_salary.set_index('NAME', inplace = True)

In [8]:
rbs_final_salary.head()

                     final_rank   salary
NAME
Christian McCaffrey         1.0  4310326
Marlon Mack                 2.0   704912
Joe Mixon                   3.0  1362544
Saquon Barkley              4.0  7798688
Josh Jacobs                 6.0  2983350

In [9]:
rbs_final_salary.to_csv('../Capstone_csv_file/rbs_final_salary_19-20')